Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PB16I_CCL0_OUT3                        _UINT32_(48)
#define MUX_PB16I_CCL0_OUT3                        _UINT32_(8) 
#define PINMUX_PB16I_CCL0_OUT3                     ((PIN_PB16I_CCL0_OUT3 << 16) | MUX_PB16I_CCL0_OUT3)
#define PORT_PB16I_CCL0_OUT3                       (_UINT32_(1) << 16)

#define PIN_PC00I_CCL0_OUT3                        _UINT32_(64)
#define MUX_PC00I_CCL0_OUT3                        _UINT32_(8) 
#define PINMUX_PC00I_CCL0_OUT3                     ((PIN_PC00I_CCL0_OUT3 << 16) | MUX_PC00I_CCL0_OUT3)
#define PORT_PC00I_CCL0_OUT3                       (_UINT32_(1) << 0)

/* ================== PORT definition for CCL1 peripheral =================== */
#define PIN_PC11I_CCL1_IN0                         _UINT32_(75)
#define MUX_PC11I_CCL1_IN0                         _UINT32_(8) 
#define PINMUX_PC11I_CCL1_IN0                      ((PIN_PC11I_CCL1_IN0 << 16) | MUX_PC11I_CCL1_IN0)
#define PORT_PC11I_CCL1_IN0                        (_UINT32_(1) << 11)

#define PIN_PC04I_CCL1_IN0                         _UINT32_(68)
#define MUX_PC04I_CCL1_IN0                         _UINT32_(8) 
#define PINMUX_PC04I_CCL1_IN0                      ((PIN_PC04I_CCL1_IN0 << 16) | MUX_PC04I_CCL1_IN0)
#define PORT_PC04I_CCL1_IN0                        (_UINT32_(1) << 4)

#define PIN_PC17I_CCL1_IN1                         _UINT32_(81)
#define MUX_PC17I_CCL1_IN1                         _UINT32_(8) 
#define PINMUX_PC17I_CCL1_IN1                      ((PIN_PC17I_CCL1_IN1 << 16) | MUX_PC17I_CCL1_IN1)
#define PORT_PC17I_CCL1_IN1                        (_UINT32_(1) << 17)

#define PIN_PC05I_CCL1_IN1                         _UINT32_(69)
#define MUX_PC05I_CCL1_IN1                         _UINT32_(8) 
#define PINMUX_PC05I_CCL1_IN1                      ((PIN_PC05I_CCL1_IN1 << 16) | MUX_PC05I_CCL1_IN1)
#define PORT_PC05I_CCL1_IN1                        (_UINT32_(1) << 5)

#define PIN_PC16I_CCL1_IN2                         _UINT32_(80)
#define MUX_PC16I_CCL1_IN2                         _UINT32_(8) 
#define PINMUX_PC16I_CCL1_IN2                      ((PIN_PC16I_CCL1_IN2 << 16) | MUX_PC16I_CCL1_IN2)
#define PORT_PC16I_CCL1_IN2                        (_UINT32_(1) << 16)

#define PIN_PC10I_CCL1_IN2                         _UINT32_(74)
#define MUX_PC10I_CCL1_IN2                         _UINT32_(8) 
#define PINMUX_PC10I_CCL1_IN2                      ((PIN_PC10I_CCL1_IN2 << 16) | MUX_PC10I_CCL1_IN2)
#define PORT_PC10I_CCL1_IN2                        (_UINT32_(1) << 10)

#define PIN_PD06I_CCL1_IN3                         _UINT32_(102)
#define MUX_PD06I_CCL1_IN3                         _UINT32_(8) 
#define PINMUX_PD06I_CCL1_IN3                      ((PIN_PD06I_CCL1_IN3 << 16) | MUX_PD06I_CCL1_IN3)
#define PORT_PD06I_CCL1_IN3                        (_UINT32_(1) << 6)

#define PIN_PD20I_CCL1_IN3                         _UINT32_(116)
#define MUX_PD20I_CCL1_IN3                         _UINT32_(8) 
#define PINMUX_PD20I_CCL1_IN3                      ((PIN_PD20I_CCL1_IN3 << 16) | MUX_PD20I_CCL1_IN3)
#define PORT_PD20I_CCL1_IN3                        (_UINT32_(1) << 20)

#define PIN_PD16I_CCL1_IN4                         _UINT32_(112)
#define MUX_PD16I_CCL1_IN4                         _UINT32_(8) 
#define PINMUX_PD16I_CCL1_IN4                      ((PIN_PD16I_CCL1_IN4 << 16) | MUX_PD16I_CCL1_IN4)
#define PORT_PD16I_CCL1_IN4                        (_UINT32_(1) << 16)

#define PIN_PD07I_CCL1_IN4                         _UINT32_(103)
#define MUX_PD07I_CCL1_IN4                         _UINT32_(8) 
#define PINMUX_PD07I_CCL1_IN4                      ((PIN_PD07I_CCL1_IN4 << 16) | MUX_PD07I_CCL1_IN4)
#define PORT_PD07I_CCL1_IN4                        (_UINT32_(1) << 7)

#define PIN_PD11I_CCL1_IN5                         _UINT32_(107)
#define MUX_PD11I_CCL1_IN5                         _UINT32_(8) 
#define PINMUX_PD11I_CCL1_IN5                      ((PIN_PD11I_CCL1_IN5 << 16) | MUX_PD11I_CCL1_IN5)
#define PORT_PD11I_CCL1_IN5                        (_UINT32_(1) << 11)

#define PIN_PD12I_CCL1_IN5                         _UINT32_(108)
#define MUX_PD12I_CCL1_IN5                         _UINT32_(8) 
#define PINMUX_PD12I_CCL1_IN5                      ((PIN_PD12I_CCL1_IN5 << 16) | MUX_PD12I_CCL1_IN5)
#define PORT_PD12I_CCL1_IN5                        (_UINT32_(1) << 12)

#define PIN_PA16I_CCL1_IN6                         _UINT32_(16)
#define MUX_PA16I_CCL1_IN6                         _UINT32_(8) 
#define PINMUX_PA16I_CCL1_IN6                      ((PIN_PA16I_CCL1_IN6 << 16) | MUX_PA16I_CCL1_IN6)
#define PORT_PA16I_CCL1_IN6                        (_UINT32_(1) << 16)

#define PIN_PA09I_CCL1_IN6                         _UINT32_(9) 
#define MUX_PA09I_CCL1_IN6                         _UINT32_(8) 
#define PINMUX_PA09I_CCL1_IN6                      ((PIN_PA09I_CCL1_IN6 << 16) | MUX_PA09I_CCL1_IN6)
#define PORT_PA09I_CCL1_IN6                        (_UINT32_(1) << 9)

#define PIN_PA17I_CCL1_IN7                         _UINT32_(17)
#define MUX_PA17I_CCL1_IN7                         _UINT32_(8) 
#define PINMUX_PA17I_CCL1_IN7                      ((PIN_PA17I_CCL1_IN7 << 16) | MUX_PA17I_CCL1_IN7)
#define PORT_PA17I_CCL1_IN7                        (_UINT32_(1) << 17)

#define PIN_PA06I_CCL1_IN7                         _UINT32_(6) 
#define MUX_PA06I_CCL1_IN7                         _UINT32_(8) 
#define PINMUX_PA06I_CCL1_IN7                      ((PIN_PA06I_CCL1_IN7 << 16) | MUX_PA06I_CCL1_IN7)
#define PORT_PA06I_CCL1_IN7                        (_UINT32_(1) << 6)

#define PIN_PA11I_CCL1_IN8                         _UINT32_(11)
#define MUX_PA11I_CCL1_IN8                         _UINT32_(8) 
#define PINMUX_PA11I_CCL1_IN8                      ((PIN_PA11I_CCL1_IN8 << 16) | MUX_PA11I_CCL1_IN8)
#define PORT_PA11I_CCL1_IN8                        (_UINT32_(1) << 11)

#define PIN_PA12I_CCL1_IN8                         _UINT32_(12)
#define MUX_PA12I_CCL1_IN8                         _UINT32_(8) 
#define PINMUX_PA12I_CCL1_IN8                      ((PIN_PA12I_CCL1_IN8 << 16) | MUX_PA12I_CCL1_IN8)
#define PORT_PA12I_CCL1_IN8                        (_UINT32_(1) << 12)

#define PIN_PB11I_CCL1_IN9                         _UINT32_(43)
#define MUX_PB11I_CCL1_IN9                         _UINT32_(8) 
#define PINMUX_PB11I_CCL1_IN9                      ((PIN_PB11I_CCL1_IN9 << 16) | MUX_PB11I_CCL1_IN9)
#define PORT_PB11I_CCL1_IN9                        (_UINT32_(1) << 11)

#define PIN_PB04I_CCL1_IN9                         _UINT32_(36)
#define MUX_PB04I_CCL1_IN9                         _UINT32_(8) 
#define PINMUX_PB04I_CCL1_IN9                      ((PIN_PB04I_CCL1_IN9 << 16) | MUX_PB04I_CCL1_IN9)
#define PORT_PB04I_CCL1_IN9                        (_UINT32_(1) << 4)

