Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PB13I_CCL1_IN10                        _UINT32_(45)
#define MUX_PB13I_CCL1_IN10                        _UINT32_(8) 
#define PINMUX_PB13I_CCL1_IN10                     ((PIN_PB13I_CCL1_IN10 << 16) | MUX_PB13I_CCL1_IN10)
#define PORT_PB13I_CCL1_IN10                       (_UINT32_(1) << 13)

#define PIN_PB03I_CCL1_IN10                        _UINT32_(35)
#define MUX_PB03I_CCL1_IN10                        _UINT32_(8) 
#define PINMUX_PB03I_CCL1_IN10                     ((PIN_PB03I_CCL1_IN10 << 16) | MUX_PB03I_CCL1_IN10)
#define PORT_PB03I_CCL1_IN10                       (_UINT32_(1) << 3)

#define PIN_PB07I_CCL1_IN11                        _UINT32_(39)
#define MUX_PB07I_CCL1_IN11                        _UINT32_(8) 
#define PINMUX_PB07I_CCL1_IN11                     ((PIN_PB07I_CCL1_IN11 << 16) | MUX_PB07I_CCL1_IN11)
#define PORT_PB07I_CCL1_IN11                       (_UINT32_(1) << 7)

#define PIN_PB08I_CCL1_IN11                        _UINT32_(40)
#define MUX_PB08I_CCL1_IN11                        _UINT32_(8) 
#define PINMUX_PB08I_CCL1_IN11                     ((PIN_PB08I_CCL1_IN11 << 16) | MUX_PB08I_CCL1_IN11)
#define PORT_PB08I_CCL1_IN11                       (_UINT32_(1) << 8)

#define PIN_PC19I_CCL1_OUT0                        _UINT32_(83)
#define MUX_PC19I_CCL1_OUT0                        _UINT32_(8) 
#define PINMUX_PC19I_CCL1_OUT0                     ((PIN_PC19I_CCL1_OUT0 << 16) | MUX_PC19I_CCL1_OUT0)
#define PORT_PC19I_CCL1_OUT0                       (_UINT32_(1) << 19)

#define PIN_PC06I_CCL1_OUT0                        _UINT32_(70)
#define MUX_PC06I_CCL1_OUT0                        _UINT32_(8) 
#define PINMUX_PC06I_CCL1_OUT0                     ((PIN_PC06I_CCL1_OUT0 << 16) | MUX_PC06I_CCL1_OUT0)
#define PORT_PC06I_CCL1_OUT0                       (_UINT32_(1) << 6)

#define PIN_PD15I_CCL1_OUT1                        _UINT32_(111)
#define MUX_PD15I_CCL1_OUT1                        _UINT32_(8) 
#define PINMUX_PD15I_CCL1_OUT1                     ((PIN_PD15I_CCL1_OUT1 << 16) | MUX_PD15I_CCL1_OUT1)
#define PORT_PD15I_CCL1_OUT1                       (_UINT32_(1) << 15)

#define PIN_PD09I_CCL1_OUT1                        _UINT32_(105)
#define MUX_PD09I_CCL1_OUT1                        _UINT32_(8) 
#define PINMUX_PD09I_CCL1_OUT1                     ((PIN_PD09I_CCL1_OUT1 << 16) | MUX_PD09I_CCL1_OUT1)
#define PORT_PD09I_CCL1_OUT1                       (_UINT32_(1) << 9)

#define PIN_PA05I_CCL1_OUT2                        _UINT32_(5) 
#define MUX_PA05I_CCL1_OUT2                        _UINT32_(8) 
#define PINMUX_PA05I_CCL1_OUT2                     ((PIN_PA05I_CCL1_OUT2 << 16) | MUX_PA05I_CCL1_OUT2)
#define PORT_PA05I_CCL1_OUT2                       (_UINT32_(1) << 5)

#define PIN_PA20I_CCL1_OUT2                        _UINT32_(20)
#define MUX_PA20I_CCL1_OUT2                        _UINT32_(8) 
#define PINMUX_PA20I_CCL1_OUT2                     ((PIN_PA20I_CCL1_OUT2 << 16) | MUX_PA20I_CCL1_OUT2)
#define PORT_PA20I_CCL1_OUT2                       (_UINT32_(1) << 20)

#define PIN_PB00I_CCL1_OUT3                        _UINT32_(32)
#define MUX_PB00I_CCL1_OUT3                        _UINT32_(8) 
#define PINMUX_PB00I_CCL1_OUT3                     ((PIN_PB00I_CCL1_OUT3 << 16) | MUX_PB00I_CCL1_OUT3)
#define PORT_PB00I_CCL1_OUT3                       (_UINT32_(1) << 0)

#define PIN_PB17I_CCL1_OUT3                        _UINT32_(49)
#define MUX_PB17I_CCL1_OUT3                        _UINT32_(8) 
#define PINMUX_PB17I_CCL1_OUT3                     ((PIN_PB17I_CCL1_OUT3 << 16) | MUX_PB17I_CCL1_OUT3)
#define PORT_PB17I_CCL1_OUT3                       (_UINT32_(1) << 17)

/* =================== PORT definition for EIC peripheral =================== */
#define PIN_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define MUX_PA00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA00A_EIC_EXTINT0                   ((PIN_PA00A_EIC_EXTINT0 << 16) | MUX_PA00A_EIC_EXTINT0)
#define PORT_PA00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PA00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA00 External Interrupt Line */

#define PIN_PA16A_EIC_EXTINT0                      _UINT32_(16)
#define MUX_PA16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PA16A_EIC_EXTINT0                   ((PIN_PA16A_EIC_EXTINT0 << 16) | MUX_PA16A_EIC_EXTINT0)
#define PORT_PA16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PA16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PA16 External Interrupt Line */

#define PIN_PB00A_EIC_EXTINT0                      _UINT32_(32)
#define MUX_PB00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB00A_EIC_EXTINT0                   ((PIN_PB00A_EIC_EXTINT0 << 16) | MUX_PB00A_EIC_EXTINT0)
#define PORT_PB00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PB00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB00 External Interrupt Line */

#define PIN_PB15A_EIC_EXTINT0                      _UINT32_(47)
#define MUX_PB15A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PB15A_EIC_EXTINT0                   ((PIN_PB15A_EIC_EXTINT0 << 16) | MUX_PB15A_EIC_EXTINT0)
#define PORT_PB15A_EIC_EXTINT0                     (_UINT32_(1) << 15)
#define PIN_PB15A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PB15 External Interrupt Line */

#define PIN_PC00A_EIC_EXTINT0                      _UINT32_(64)
#define MUX_PC00A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC00A_EIC_EXTINT0                   ((PIN_PC00A_EIC_EXTINT0 << 16) | MUX_PC00A_EIC_EXTINT0)
#define PORT_PC00A_EIC_EXTINT0                     (_UINT32_(1) << 0)
#define PIN_PC00A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC00 External Interrupt Line */

#define PIN_PC16A_EIC_EXTINT0                      _UINT32_(80)
#define MUX_PC16A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PC16A_EIC_EXTINT0                   ((PIN_PC16A_EIC_EXTINT0 << 16) | MUX_PC16A_EIC_EXTINT0)
#define PORT_PC16A_EIC_EXTINT0                     (_UINT32_(1) << 16)
#define PIN_PC16A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PC16 External Interrupt Line */

#define PIN_PD18A_EIC_EXTINT0                      _UINT32_(114)
#define MUX_PD18A_EIC_EXTINT0                      _UINT32_(0) 
#define PINMUX_PD18A_EIC_EXTINT0                   ((PIN_PD18A_EIC_EXTINT0 << 16) | MUX_PD18A_EIC_EXTINT0)
#define PORT_PD18A_EIC_EXTINT0                     (_UINT32_(1) << 18)
#define PIN_PD18A_EIC_EXTINT_NUM                   _UINT32_(0)  /* EIC signal: PIN_PD18 External Interrupt Line */

#define PIN_PA01A_EIC_EXTINT1                      _UINT32_(1) 
#define MUX_PA01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA01A_EIC_EXTINT1                   ((PIN_PA01A_EIC_EXTINT1 << 16) | MUX_PA01A_EIC_EXTINT1)
#define PORT_PA01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PA01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA01 External Interrupt Line */

#define PIN_PA17A_EIC_EXTINT1                      _UINT32_(17)
#define MUX_PA17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PA17A_EIC_EXTINT1                   ((PIN_PA17A_EIC_EXTINT1 << 16) | MUX_PA17A_EIC_EXTINT1)
#define PORT_PA17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PA17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PA17 External Interrupt Line */

#define PIN_PB01A_EIC_EXTINT1                      _UINT32_(33)
#define MUX_PB01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB01A_EIC_EXTINT1                   ((PIN_PB01A_EIC_EXTINT1 << 16) | MUX_PB01A_EIC_EXTINT1)
#define PORT_PB01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PB01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB01 External Interrupt Line */

#define PIN_PB16A_EIC_EXTINT1                      _UINT32_(48)
#define MUX_PB16A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PB16A_EIC_EXTINT1                   ((PIN_PB16A_EIC_EXTINT1 << 16) | MUX_PB16A_EIC_EXTINT1)
#define PORT_PB16A_EIC_EXTINT1                     (_UINT32_(1) << 16)
#define PIN_PB16A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PB16 External Interrupt Line */

#define PIN_PC01A_EIC_EXTINT1                      _UINT32_(65)
#define MUX_PC01A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC01A_EIC_EXTINT1                   ((PIN_PC01A_EIC_EXTINT1 << 16) | MUX_PC01A_EIC_EXTINT1)
#define PORT_PC01A_EIC_EXTINT1                     (_UINT32_(1) << 1)
#define PIN_PC01A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC01 External Interrupt Line */

#define PIN_PC17A_EIC_EXTINT1                      _UINT32_(81)
#define MUX_PC17A_EIC_EXTINT1                      _UINT32_(0) 
#define PINMUX_PC17A_EIC_EXTINT1                   ((PIN_PC17A_EIC_EXTINT1 << 16) | MUX_PC17A_EIC_EXTINT1)
#define PORT_PC17A_EIC_EXTINT1                     (_UINT32_(1) << 17)
#define PIN_PC17A_EIC_EXTINT_NUM                   _UINT32_(1)  /* EIC signal: PIN_PC17 External Interrupt Line */

