Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PB08A_EIC_EXTINT9                      _UINT32_(40)
#define MUX_PB08A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PB08A_EIC_EXTINT9                   ((PIN_PB08A_EIC_EXTINT9 << 16) | MUX_PB08A_EIC_EXTINT9)
#define PORT_PB08A_EIC_EXTINT9                     (_UINT32_(1) << 8)
#define PIN_PB08A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PB08 External Interrupt Line */

#define PIN_PC09A_EIC_EXTINT9                      _UINT32_(73)
#define MUX_PC09A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PC09A_EIC_EXTINT9                   ((PIN_PC09A_EIC_EXTINT9 << 16) | MUX_PC09A_EIC_EXTINT9)
#define PORT_PC09A_EIC_EXTINT9                     (_UINT32_(1) << 9)
#define PIN_PC09A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PC09 External Interrupt Line */

#define PIN_PD11A_EIC_EXTINT9                      _UINT32_(107)
#define MUX_PD11A_EIC_EXTINT9                      _UINT32_(0) 
#define PINMUX_PD11A_EIC_EXTINT9                   ((PIN_PD11A_EIC_EXTINT9 << 16) | MUX_PD11A_EIC_EXTINT9)
#define PORT_PD11A_EIC_EXTINT9                     (_UINT32_(1) << 11)
#define PIN_PD11A_EIC_EXTINT_NUM                   _UINT32_(9)  /* EIC signal: PIN_PD11 External Interrupt Line */

#define PIN_PA10A_EIC_EXTINT10                     _UINT32_(10)
#define MUX_PA10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PA10A_EIC_EXTINT10                  ((PIN_PA10A_EIC_EXTINT10 << 16) | MUX_PA10A_EIC_EXTINT10)
#define PORT_PA10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PA10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PA10 External Interrupt Line */

#define PIN_PB09A_EIC_EXTINT10                     _UINT32_(41)
#define MUX_PB09A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PB09A_EIC_EXTINT10                  ((PIN_PB09A_EIC_EXTINT10 << 16) | MUX_PB09A_EIC_EXTINT10)
#define PORT_PB09A_EIC_EXTINT10                    (_UINT32_(1) << 9)
#define PIN_PB09A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PB09 External Interrupt Line */

#define PIN_PC10A_EIC_EXTINT10                     _UINT32_(74)
#define MUX_PC10A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PC10A_EIC_EXTINT10                  ((PIN_PC10A_EIC_EXTINT10 << 16) | MUX_PC10A_EIC_EXTINT10)
#define PORT_PC10A_EIC_EXTINT10                    (_UINT32_(1) << 10)
#define PIN_PC10A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PC10 External Interrupt Line */

#define PIN_PD12A_EIC_EXTINT10                     _UINT32_(108)
#define MUX_PD12A_EIC_EXTINT10                     _UINT32_(0) 
#define PINMUX_PD12A_EIC_EXTINT10                  ((PIN_PD12A_EIC_EXTINT10 << 16) | MUX_PD12A_EIC_EXTINT10)
#define PORT_PD12A_EIC_EXTINT10                    (_UINT32_(1) << 12)
#define PIN_PD12A_EIC_EXTINT_NUM                   _UINT32_(10) /* EIC signal: PIN_PD12 External Interrupt Line */

#define PIN_PA11A_EIC_EXTINT11                     _UINT32_(11)
#define MUX_PA11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PA11A_EIC_EXTINT11                  ((PIN_PA11A_EIC_EXTINT11 << 16) | MUX_PA11A_EIC_EXTINT11)
#define PORT_PA11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PA11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PA11 External Interrupt Line */

#define PIN_PB10A_EIC_EXTINT11                     _UINT32_(42)
#define MUX_PB10A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PB10A_EIC_EXTINT11                  ((PIN_PB10A_EIC_EXTINT11 << 16) | MUX_PB10A_EIC_EXTINT11)
#define PORT_PB10A_EIC_EXTINT11                    (_UINT32_(1) << 10)
#define PIN_PB10A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PB10 External Interrupt Line */

#define PIN_PC11A_EIC_EXTINT11                     _UINT32_(75)
#define MUX_PC11A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PC11A_EIC_EXTINT11                  ((PIN_PC11A_EIC_EXTINT11 << 16) | MUX_PC11A_EIC_EXTINT11)
#define PORT_PC11A_EIC_EXTINT11                    (_UINT32_(1) << 11)
#define PIN_PC11A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PC11 External Interrupt Line */

#define PIN_PD13A_EIC_EXTINT11                     _UINT32_(109)
#define MUX_PD13A_EIC_EXTINT11                     _UINT32_(0) 
#define PINMUX_PD13A_EIC_EXTINT11                  ((PIN_PD13A_EIC_EXTINT11 << 16) | MUX_PD13A_EIC_EXTINT11)
#define PORT_PD13A_EIC_EXTINT11                    (_UINT32_(1) << 13)
#define PIN_PD13A_EIC_EXTINT_NUM                   _UINT32_(11) /* EIC signal: PIN_PD13 External Interrupt Line */

#define PIN_PA12A_EIC_EXTINT12                     _UINT32_(12)
#define MUX_PA12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PA12A_EIC_EXTINT12                  ((PIN_PA12A_EIC_EXTINT12 << 16) | MUX_PA12A_EIC_EXTINT12)
#define PORT_PA12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PA12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PA12 External Interrupt Line */

#define PIN_PB11A_EIC_EXTINT12                     _UINT32_(43)
#define MUX_PB11A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PB11A_EIC_EXTINT12                  ((PIN_PB11A_EIC_EXTINT12 << 16) | MUX_PB11A_EIC_EXTINT12)
#define PORT_PB11A_EIC_EXTINT12                    (_UINT32_(1) << 11)
#define PIN_PB11A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PB11 External Interrupt Line */

#define PIN_PC12A_EIC_EXTINT12                     _UINT32_(76)
#define MUX_PC12A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PC12A_EIC_EXTINT12                  ((PIN_PC12A_EIC_EXTINT12 << 16) | MUX_PC12A_EIC_EXTINT12)
#define PORT_PC12A_EIC_EXTINT12                    (_UINT32_(1) << 12)
#define PIN_PC12A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PC12 External Interrupt Line */

#define PIN_PD14A_EIC_EXTINT12                     _UINT32_(110)
#define MUX_PD14A_EIC_EXTINT12                     _UINT32_(0) 
#define PINMUX_PD14A_EIC_EXTINT12                  ((PIN_PD14A_EIC_EXTINT12 << 16) | MUX_PD14A_EIC_EXTINT12)
#define PORT_PD14A_EIC_EXTINT12                    (_UINT32_(1) << 14)
#define PIN_PD14A_EIC_EXTINT_NUM                   _UINT32_(12) /* EIC signal: PIN_PD14 External Interrupt Line */

