Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PC00K_GCLK_IO1                         _UINT32_(64)
#define MUX_PC00K_GCLK_IO1                         _UINT32_(10)
#define PINMUX_PC00K_GCLK_IO1                      ((PIN_PC00K_GCLK_IO1 << 16) | MUX_PC00K_GCLK_IO1)
#define PORT_PC00K_GCLK_IO1                        (_UINT32_(1) << 0)

#define PIN_PC10K_GCLK_IO1                         _UINT32_(74)
#define MUX_PC10K_GCLK_IO1                         _UINT32_(10)
#define PINMUX_PC10K_GCLK_IO1                      ((PIN_PC10K_GCLK_IO1 << 16) | MUX_PC10K_GCLK_IO1)
#define PORT_PC10K_GCLK_IO1                        (_UINT32_(1) << 10)

#define PIN_PC05K_GCLK_IO1                         _UINT32_(69)
#define MUX_PC05K_GCLK_IO1                         _UINT32_(10)
#define PINMUX_PC05K_GCLK_IO1                      ((PIN_PC05K_GCLK_IO1 << 16) | MUX_PC05K_GCLK_IO1)
#define PORT_PC05K_GCLK_IO1                        (_UINT32_(1) << 5)

#define PIN_PD04K_GCLK_IO1                         _UINT32_(100)
#define MUX_PD04K_GCLK_IO1                         _UINT32_(10)
#define PINMUX_PD04K_GCLK_IO1                      ((PIN_PD04K_GCLK_IO1 << 16) | MUX_PD04K_GCLK_IO1)
#define PORT_PD04K_GCLK_IO1                        (_UINT32_(1) << 4)

#define PIN_PC01K_GCLK_IO2                         _UINT32_(65)
#define MUX_PC01K_GCLK_IO2                         _UINT32_(10)
#define PINMUX_PC01K_GCLK_IO2                      ((PIN_PC01K_GCLK_IO2 << 16) | MUX_PC01K_GCLK_IO2)
#define PORT_PC01K_GCLK_IO2                        (_UINT32_(1) << 1)

#define PIN_PC02K_GCLK_IO3                         _UINT32_(66)
#define MUX_PC02K_GCLK_IO3                         _UINT32_(10)
#define PINMUX_PC02K_GCLK_IO3                      ((PIN_PC02K_GCLK_IO3 << 16) | MUX_PC02K_GCLK_IO3)
#define PORT_PC02K_GCLK_IO3                        (_UINT32_(1) << 2)

#define PIN_PC03K_GCLK_IO4                         _UINT32_(67)
#define MUX_PC03K_GCLK_IO4                         _UINT32_(10)
#define PINMUX_PC03K_GCLK_IO4                      ((PIN_PC03K_GCLK_IO4 << 16) | MUX_PC03K_GCLK_IO4)
#define PORT_PC03K_GCLK_IO4                        (_UINT32_(1) << 3)

#define PIN_PC04K_GCLK_IO5                         _UINT32_(68)
#define MUX_PC04K_GCLK_IO5                         _UINT32_(10)
#define PINMUX_PC04K_GCLK_IO5                      ((PIN_PC04K_GCLK_IO5 << 16) | MUX_PC04K_GCLK_IO5)
#define PORT_PC04K_GCLK_IO5                        (_UINT32_(1) << 4)

#define PIN_PB16K_GCLK_IO6                         _UINT32_(48)
#define MUX_PB16K_GCLK_IO6                         _UINT32_(10)
#define PINMUX_PB16K_GCLK_IO6                      ((PIN_PB16K_GCLK_IO6 << 16) | MUX_PB16K_GCLK_IO6)
#define PORT_PB16K_GCLK_IO6                        (_UINT32_(1) << 16)

#define PIN_PB10K_GCLK_IO6                         _UINT32_(42)
#define MUX_PB10K_GCLK_IO6                         _UINT32_(10)
#define PINMUX_PB10K_GCLK_IO6                      ((PIN_PB10K_GCLK_IO6 << 16) | MUX_PB10K_GCLK_IO6)
#define PORT_PB10K_GCLK_IO6                        (_UINT32_(1) << 10)

#define PIN_PB09K_GCLK_IO7                         _UINT32_(41)
#define MUX_PB09K_GCLK_IO7                         _UINT32_(10)
#define PINMUX_PB09K_GCLK_IO7                      ((PIN_PB09K_GCLK_IO7 << 16) | MUX_PB09K_GCLK_IO7)
#define PORT_PB09K_GCLK_IO7                        (_UINT32_(1) << 9)

/* =================== PORT definition for PTC peripheral =================== */
#define PIN_PD06P_PTC_DRV0                         _UINT32_(102)
#define MUX_PD06P_PTC_DRV0                         _UINT32_(15)
#define PINMUX_PD06P_PTC_DRV0                      ((PIN_PD06P_PTC_DRV0 << 16) | MUX_PD06P_PTC_DRV0)
#define PORT_PD06P_PTC_DRV0                        (_UINT32_(1) << 6)

#define PIN_PD07P_PTC_DRV1                         _UINT32_(103)
#define MUX_PD07P_PTC_DRV1                         _UINT32_(15)
#define PINMUX_PD07P_PTC_DRV1                      ((PIN_PD07P_PTC_DRV1 << 16) | MUX_PD07P_PTC_DRV1)
#define PORT_PD07P_PTC_DRV1                        (_UINT32_(1) << 7)

#define PIN_PD08P_PTC_DRV2                         _UINT32_(104)
#define MUX_PD08P_PTC_DRV2                         _UINT32_(15)
#define PINMUX_PD08P_PTC_DRV2                      ((PIN_PD08P_PTC_DRV2 << 16) | MUX_PD08P_PTC_DRV2)
#define PORT_PD08P_PTC_DRV2                        (_UINT32_(1) << 8)

#define PIN_PD09P_PTC_DRV3                         _UINT32_(105)
#define MUX_PD09P_PTC_DRV3                         _UINT32_(15)
#define PINMUX_PD09P_PTC_DRV3                      ((PIN_PD09P_PTC_DRV3 << 16) | MUX_PD09P_PTC_DRV3)
#define PORT_PD09P_PTC_DRV3                        (_UINT32_(1) << 9)

#define PIN_PA00P_PTC_DRV4                         _UINT32_(0) 
#define MUX_PA00P_PTC_DRV4                         _UINT32_(15)
#define PINMUX_PA00P_PTC_DRV4                      ((PIN_PA00P_PTC_DRV4 << 16) | MUX_PA00P_PTC_DRV4)
#define PORT_PA00P_PTC_DRV4                        (_UINT32_(1) << 0)

#define PIN_PA01P_PTC_DRV5                         _UINT32_(1) 
#define MUX_PA01P_PTC_DRV5                         _UINT32_(15)
#define PINMUX_PA01P_PTC_DRV5                      ((PIN_PA01P_PTC_DRV5 << 16) | MUX_PA01P_PTC_DRV5)
#define PORT_PA01P_PTC_DRV5                        (_UINT32_(1) << 1)

#define PIN_PA02P_PTC_DRV6                         _UINT32_(2) 
#define MUX_PA02P_PTC_DRV6                         _UINT32_(15)
#define PINMUX_PA02P_PTC_DRV6                      ((PIN_PA02P_PTC_DRV6 << 16) | MUX_PA02P_PTC_DRV6)
#define PORT_PA02P_PTC_DRV6                        (_UINT32_(1) << 2)

#define PIN_PA03P_PTC_DRV7                         _UINT32_(3) 
#define MUX_PA03P_PTC_DRV7                         _UINT32_(15)
#define PINMUX_PA03P_PTC_DRV7                      ((PIN_PA03P_PTC_DRV7 << 16) | MUX_PA03P_PTC_DRV7)
#define PORT_PA03P_PTC_DRV7                        (_UINT32_(1) << 3)

#define PIN_PA04P_PTC_DRV8                         _UINT32_(4) 
#define MUX_PA04P_PTC_DRV8                         _UINT32_(15)
#define PINMUX_PA04P_PTC_DRV8                      ((PIN_PA04P_PTC_DRV8 << 16) | MUX_PA04P_PTC_DRV8)
#define PORT_PA04P_PTC_DRV8                        (_UINT32_(1) << 4)

#define PIN_PA05P_PTC_DRV9                         _UINT32_(5) 
#define MUX_PA05P_PTC_DRV9                         _UINT32_(15)
#define PINMUX_PA05P_PTC_DRV9                      ((PIN_PA05P_PTC_DRV9 << 16) | MUX_PA05P_PTC_DRV9)
#define PORT_PA05P_PTC_DRV9                        (_UINT32_(1) << 5)

#define PIN_PA06P_PTC_DRV10                        _UINT32_(6) 
#define MUX_PA06P_PTC_DRV10                        _UINT32_(15)
#define PINMUX_PA06P_PTC_DRV10                     ((PIN_PA06P_PTC_DRV10 << 16) | MUX_PA06P_PTC_DRV10)
#define PORT_PA06P_PTC_DRV10                       (_UINT32_(1) << 6)

#define PIN_PA07P_PTC_DRV11                        _UINT32_(7) 
#define MUX_PA07P_PTC_DRV11                        _UINT32_(15)
#define PINMUX_PA07P_PTC_DRV11                     ((PIN_PA07P_PTC_DRV11 << 16) | MUX_PA07P_PTC_DRV11)
#define PORT_PA07P_PTC_DRV11                       (_UINT32_(1) << 7)

#define PIN_PA08P_PTC_DRV12                        _UINT32_(8) 
#define MUX_PA08P_PTC_DRV12                        _UINT32_(15)
#define PINMUX_PA08P_PTC_DRV12                     ((PIN_PA08P_PTC_DRV12 << 16) | MUX_PA08P_PTC_DRV12)
#define PORT_PA08P_PTC_DRV12                       (_UINT32_(1) << 8)

#define PIN_PA09P_PTC_DRV13                        _UINT32_(9) 
#define MUX_PA09P_PTC_DRV13                        _UINT32_(15)
#define PINMUX_PA09P_PTC_DRV13                     ((PIN_PA09P_PTC_DRV13 << 16) | MUX_PA09P_PTC_DRV13)
#define PORT_PA09P_PTC_DRV13                       (_UINT32_(1) << 9)

#define PIN_PB00P_PTC_DRV14                        _UINT32_(32)
#define MUX_PB00P_PTC_DRV14                        _UINT32_(15)
#define PINMUX_PB00P_PTC_DRV14                     ((PIN_PB00P_PTC_DRV14 << 16) | MUX_PB00P_PTC_DRV14)
#define PORT_PB00P_PTC_DRV14                       (_UINT32_(1) << 0)

#define PIN_PB03P_PTC_DRV15                        _UINT32_(35)
#define MUX_PB03P_PTC_DRV15                        _UINT32_(15)
#define PINMUX_PB03P_PTC_DRV15                     ((PIN_PB03P_PTC_DRV15 << 16) | MUX_PB03P_PTC_DRV15)
#define PORT_PB03P_PTC_DRV15                       (_UINT32_(1) << 3)

#define PIN_PB04P_PTC_DRV16                        _UINT32_(36)
#define MUX_PB04P_PTC_DRV16                        _UINT32_(15)
#define PINMUX_PB04P_PTC_DRV16                     ((PIN_PB04P_PTC_DRV16 << 16) | MUX_PB04P_PTC_DRV16)
#define PORT_PB04P_PTC_DRV16                       (_UINT32_(1) << 4)

#define PIN_PB05P_PTC_DRV17                        _UINT32_(37)
#define MUX_PB05P_PTC_DRV17                        _UINT32_(15)
#define PINMUX_PB05P_PTC_DRV17                     ((PIN_PB05P_PTC_DRV17 << 16) | MUX_PB05P_PTC_DRV17)
#define PORT_PB05P_PTC_DRV17                       (_UINT32_(1) << 5)

#define PIN_PB06P_PTC_DRV18                        _UINT32_(38)
#define MUX_PB06P_PTC_DRV18                        _UINT32_(15)
#define PINMUX_PB06P_PTC_DRV18                     ((PIN_PB06P_PTC_DRV18 << 16) | MUX_PB06P_PTC_DRV18)
#define PORT_PB06P_PTC_DRV18                       (_UINT32_(1) << 6)

