Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PB10P_PTC_PTCXY29                      _UINT32_(42)
#define MUX_PB10P_PTC_PTCXY29                      _UINT32_(15)
#define PINMUX_PB10P_PTC_PTCXY29                   ((PIN_PB10P_PTC_PTCXY29 << 16) | MUX_PB10P_PTC_PTCXY29)
#define PORT_PB10P_PTC_PTCXY29                     (_UINT32_(1) << 10)

#define PIN_PC09P_PTC_PTCXY30                      _UINT32_(73)
#define MUX_PC09P_PTC_PTCXY30                      _UINT32_(15)
#define PINMUX_PC09P_PTC_PTCXY30                   ((PIN_PC09P_PTC_PTCXY30 << 16) | MUX_PC09P_PTC_PTCXY30)
#define PORT_PC09P_PTC_PTCXY30                     (_UINT32_(1) << 9)

#define PIN_PC10P_PTC_PTCXY31                      _UINT32_(74)
#define MUX_PC10P_PTC_PTCXY31                      _UINT32_(15)
#define PINMUX_PC10P_PTC_PTCXY31                   ((PIN_PC10P_PTC_PTCXY31 << 16) | MUX_PC10P_PTC_PTCXY31)
#define PORT_PC10P_PTC_PTCXY31                     (_UINT32_(1) << 10)

#define PIN_PA14P_PTC_PTCXY32                      _UINT32_(14)
#define MUX_PA14P_PTC_PTCXY32                      _UINT32_(15)
#define PINMUX_PA14P_PTC_PTCXY32                   ((PIN_PA14P_PTC_PTCXY32 << 16) | MUX_PA14P_PTC_PTCXY32)
#define PORT_PA14P_PTC_PTCXY32                     (_UINT32_(1) << 14)

#define PIN_PA15P_PTC_PTCXY33                      _UINT32_(15)
#define MUX_PA15P_PTC_PTCXY33                      _UINT32_(15)
#define PINMUX_PA15P_PTC_PTCXY33                   ((PIN_PA15P_PTC_PTCXY33 << 16) | MUX_PA15P_PTC_PTCXY33)
#define PORT_PA15P_PTC_PTCXY33                     (_UINT32_(1) << 15)

#define PIN_PA16P_PTC_PTCXY34                      _UINT32_(16)
#define MUX_PA16P_PTC_PTCXY34                      _UINT32_(15)
#define PINMUX_PA16P_PTC_PTCXY34                   ((PIN_PA16P_PTC_PTCXY34 << 16) | MUX_PA16P_PTC_PTCXY34)
#define PORT_PA16P_PTC_PTCXY34                     (_UINT32_(1) << 16)

#define PIN_PA17P_PTC_PTCXY35                      _UINT32_(17)
#define MUX_PA17P_PTC_PTCXY35                      _UINT32_(15)
#define PINMUX_PA17P_PTC_PTCXY35                   ((PIN_PA17P_PTC_PTCXY35 << 16) | MUX_PA17P_PTC_PTCXY35)
#define PORT_PA17P_PTC_PTCXY35                     (_UINT32_(1) << 17)

/* ================= PORT definition for SERCOM0 peripheral ================= */
#define PIN_PB15D_SERCOM0_PAD0                     _UINT32_(47)
#define MUX_PB15D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PB15D_SERCOM0_PAD0                  ((PIN_PB15D_SERCOM0_PAD0 << 16) | MUX_PB15D_SERCOM0_PAD0)
#define PORT_PB15D_SERCOM0_PAD0                    (_UINT32_(1) << 15)

#define PIN_PC00D_SERCOM0_PAD0                     _UINT32_(64)
#define MUX_PC00D_SERCOM0_PAD0                     _UINT32_(3) 
#define PINMUX_PC00D_SERCOM0_PAD0                  ((PIN_PC00D_SERCOM0_PAD0 << 16) | MUX_PC00D_SERCOM0_PAD0)
#define PORT_PC00D_SERCOM0_PAD0                    (_UINT32_(1) << 0)

#define PIN_PB16D_SERCOM0_PAD1                     _UINT32_(48)
#define MUX_PB16D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PB16D_SERCOM0_PAD1                  ((PIN_PB16D_SERCOM0_PAD1 << 16) | MUX_PB16D_SERCOM0_PAD1)
#define PORT_PB16D_SERCOM0_PAD1                    (_UINT32_(1) << 16)

#define PIN_PC01D_SERCOM0_PAD1                     _UINT32_(65)
#define MUX_PC01D_SERCOM0_PAD1                     _UINT32_(3) 
#define PINMUX_PC01D_SERCOM0_PAD1                  ((PIN_PC01D_SERCOM0_PAD1 << 16) | MUX_PC01D_SERCOM0_PAD1)
#define PORT_PC01D_SERCOM0_PAD1                    (_UINT32_(1) << 1)

#define PIN_PB17D_SERCOM0_PAD2                     _UINT32_(49)
#define MUX_PB17D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PB17D_SERCOM0_PAD2                  ((PIN_PB17D_SERCOM0_PAD2 << 16) | MUX_PB17D_SERCOM0_PAD2)
#define PORT_PB17D_SERCOM0_PAD2                    (_UINT32_(1) << 17)

#define PIN_PC02D_SERCOM0_PAD2                     _UINT32_(66)
#define MUX_PC02D_SERCOM0_PAD2                     _UINT32_(3) 
#define PINMUX_PC02D_SERCOM0_PAD2                  ((PIN_PC02D_SERCOM0_PAD2 << 16) | MUX_PC02D_SERCOM0_PAD2)
#define PORT_PC02D_SERCOM0_PAD2                    (_UINT32_(1) << 2)

#define PIN_PC11D_SERCOM0_PAD3                     _UINT32_(75)
#define MUX_PC11D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC11D_SERCOM0_PAD3                  ((PIN_PC11D_SERCOM0_PAD3 << 16) | MUX_PC11D_SERCOM0_PAD3)
#define PORT_PC11D_SERCOM0_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC03D_SERCOM0_PAD3                     _UINT32_(67)
#define MUX_PC03D_SERCOM0_PAD3                     _UINT32_(3) 
#define PINMUX_PC03D_SERCOM0_PAD3                  ((PIN_PC03D_SERCOM0_PAD3 << 16) | MUX_PC03D_SERCOM0_PAD3)
#define PORT_PC03D_SERCOM0_PAD3                    (_UINT32_(1) << 3)

/* ================= PORT definition for SERCOM1 peripheral ================= */
#define PIN_PC15D_SERCOM1_PAD0                     _UINT32_(79)
#define MUX_PC15D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PC15D_SERCOM1_PAD0                  ((PIN_PC15D_SERCOM1_PAD0 << 16) | MUX_PC15D_SERCOM1_PAD0)
#define PORT_PC15D_SERCOM1_PAD0                    (_UINT32_(1) << 15)

#define PIN_PD01D_SERCOM1_PAD0                     _UINT32_(97)
#define MUX_PD01D_SERCOM1_PAD0                     _UINT32_(3) 
#define PINMUX_PD01D_SERCOM1_PAD0                  ((PIN_PD01D_SERCOM1_PAD0 << 16) | MUX_PD01D_SERCOM1_PAD0)
#define PORT_PD01D_SERCOM1_PAD0                    (_UINT32_(1) << 1)

#define PIN_PC14D_SERCOM1_PAD1                     _UINT32_(78)
#define MUX_PC14D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PC14D_SERCOM1_PAD1                  ((PIN_PC14D_SERCOM1_PAD1 << 16) | MUX_PC14D_SERCOM1_PAD1)
#define PORT_PC14D_SERCOM1_PAD1                    (_UINT32_(1) << 14)

#define PIN_PD00D_SERCOM1_PAD1                     _UINT32_(96)
#define MUX_PD00D_SERCOM1_PAD1                     _UINT32_(3) 
#define PINMUX_PD00D_SERCOM1_PAD1                  ((PIN_PD00D_SERCOM1_PAD1 << 16) | MUX_PD00D_SERCOM1_PAD1)
#define PORT_PD00D_SERCOM1_PAD1                    (_UINT32_(1) << 0)

