Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32CM5112GC00100_DFP/pio/pic32cm5112gc00100.h
#define PIN_PC09F_TCC1_WO0                         _UINT32_(73)
#define MUX_PC09F_TCC1_WO0                         _UINT32_(5) 
#define PINMUX_PC09F_TCC1_WO0                      ((PIN_PC09F_TCC1_WO0 << 16) | MUX_PC09F_TCC1_WO0)
#define PORT_PC09F_TCC1_WO0                        (_UINT32_(1) << 9)

#define PIN_PC03F_TCC1_WO1                         _UINT32_(67)
#define MUX_PC03F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PC03F_TCC1_WO1                      ((PIN_PC03F_TCC1_WO1 << 16) | MUX_PC03F_TCC1_WO1)
#define PORT_PC03F_TCC1_WO1                        (_UINT32_(1) << 3)

#define PIN_PC10F_TCC1_WO1                         _UINT32_(74)
#define MUX_PC10F_TCC1_WO1                         _UINT32_(5) 
#define PINMUX_PC10F_TCC1_WO1                      ((PIN_PC10F_TCC1_WO1 << 16) | MUX_PC10F_TCC1_WO1)
#define PORT_PC10F_TCC1_WO1                        (_UINT32_(1) << 10)

/* ================== PORT definition for TCC2 peripheral =================== */
#define PIN_PB09F_TCC2_WO0                         _UINT32_(41)
#define MUX_PB09F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PB09F_TCC2_WO0                      ((PIN_PB09F_TCC2_WO0 << 16) | MUX_PB09F_TCC2_WO0)
#define PORT_PB09F_TCC2_WO0                        (_UINT32_(1) << 9)

#define PIN_PC04F_TCC2_WO0                         _UINT32_(68)
#define MUX_PC04F_TCC2_WO0                         _UINT32_(5) 
#define PINMUX_PC04F_TCC2_WO0                      ((PIN_PC04F_TCC2_WO0 << 16) | MUX_PC04F_TCC2_WO0)
#define PORT_PC04F_TCC2_WO0                        (_UINT32_(1) << 4)

#define PIN_PB08F_TCC2_WO1                         _UINT32_(40)
#define MUX_PB08F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PB08F_TCC2_WO1                      ((PIN_PB08F_TCC2_WO1 << 16) | MUX_PB08F_TCC2_WO1)
#define PORT_PB08F_TCC2_WO1                        (_UINT32_(1) << 8)

#define PIN_PC05F_TCC2_WO1                         _UINT32_(69)
#define MUX_PC05F_TCC2_WO1                         _UINT32_(5) 
#define PINMUX_PC05F_TCC2_WO1                      ((PIN_PC05F_TCC2_WO1 << 16) | MUX_PC05F_TCC2_WO1)
#define PORT_PC05F_TCC2_WO1                        (_UINT32_(1) << 5)

/* ================== PORT definition for TCC3 peripheral =================== */
#define PIN_PB13F_TCC3_WO0                         _UINT32_(45)
#define MUX_PB13F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PB13F_TCC3_WO0                      ((PIN_PB13F_TCC3_WO0 << 16) | MUX_PB13F_TCC3_WO0)
#define PORT_PB13F_TCC3_WO0                        (_UINT32_(1) << 13)

#define PIN_PD00F_TCC3_WO0                         _UINT32_(96)
#define MUX_PD00F_TCC3_WO0                         _UINT32_(5) 
#define PINMUX_PD00F_TCC3_WO0                      ((PIN_PD00F_TCC3_WO0 << 16) | MUX_PD00F_TCC3_WO0)
#define PORT_PD00F_TCC3_WO0                        (_UINT32_(1) << 0)

#define PIN_PB14F_TCC3_WO1                         _UINT32_(46)
#define MUX_PB14F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PB14F_TCC3_WO1                      ((PIN_PB14F_TCC3_WO1 << 16) | MUX_PB14F_TCC3_WO1)
#define PORT_PB14F_TCC3_WO1                        (_UINT32_(1) << 14)

#define PIN_PD01F_TCC3_WO1                         _UINT32_(97)
#define MUX_PD01F_TCC3_WO1                         _UINT32_(5) 
#define PINMUX_PD01F_TCC3_WO1                      ((PIN_PD01F_TCC3_WO1 << 16) | MUX_PD01F_TCC3_WO1)
#define PORT_PD01F_TCC3_WO1                        (_UINT32_(1) << 1)

/* ================== PORT definition for TCC4 peripheral =================== */
#define PIN_PA10F_TCC4_WO0                         _UINT32_(10)
#define MUX_PA10F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PA10F_TCC4_WO0                      ((PIN_PA10F_TCC4_WO0 << 16) | MUX_PA10F_TCC4_WO0)
#define PORT_PA10F_TCC4_WO0                        (_UINT32_(1) << 10)

#define PIN_PD07F_TCC4_WO0                         _UINT32_(103)
#define MUX_PD07F_TCC4_WO0                         _UINT32_(5) 
#define PINMUX_PD07F_TCC4_WO0                      ((PIN_PD07F_TCC4_WO0 << 16) | MUX_PD07F_TCC4_WO0)
#define PORT_PD07F_TCC4_WO0                        (_UINT32_(1) << 7)

#define PIN_PA11F_TCC4_WO1                         _UINT32_(11)
#define MUX_PA11F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PA11F_TCC4_WO1                      ((PIN_PA11F_TCC4_WO1 << 16) | MUX_PA11F_TCC4_WO1)
#define PORT_PA11F_TCC4_WO1                        (_UINT32_(1) << 11)

#define PIN_PD08F_TCC4_WO1                         _UINT32_(104)
#define MUX_PD08F_TCC4_WO1                         _UINT32_(5) 
#define PINMUX_PD08F_TCC4_WO1                      ((PIN_PD08F_TCC4_WO1 << 16) | MUX_PD08F_TCC4_WO1)
#define PORT_PD08F_TCC4_WO1                        (_UINT32_(1) << 8)

/* ================== PORT definition for TCC5 peripheral =================== */
#define PIN_PD10F_TCC5_WO0                         _UINT32_(106)
#define MUX_PD10F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PD10F_TCC5_WO0                      ((PIN_PD10F_TCC5_WO0 << 16) | MUX_PD10F_TCC5_WO0)
#define PORT_PD10F_TCC5_WO0                        (_UINT32_(1) << 10)

#define PIN_PD09F_TCC5_WO0                         _UINT32_(105)
#define MUX_PD09F_TCC5_WO0                         _UINT32_(5) 
#define PINMUX_PD09F_TCC5_WO0                      ((PIN_PD09F_TCC5_WO0 << 16) | MUX_PD09F_TCC5_WO0)
#define PORT_PD09F_TCC5_WO0                        (_UINT32_(1) << 9)

#define PIN_PA00F_TCC5_WO1                         _UINT32_(0) 
#define MUX_PA00F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PA00F_TCC5_WO1                      ((PIN_PA00F_TCC5_WO1 << 16) | MUX_PA00F_TCC5_WO1)
#define PORT_PA00F_TCC5_WO1                        (_UINT32_(1) << 0)

#define PIN_PD11F_TCC5_WO1                         _UINT32_(107)
#define MUX_PD11F_TCC5_WO1                         _UINT32_(5) 
#define PINMUX_PD11F_TCC5_WO1                      ((PIN_PD11F_TCC5_WO1 << 16) | MUX_PD11F_TCC5_WO1)
#define PORT_PD11F_TCC5_WO1                        (_UINT32_(1) << 11)

/* ================== PORT definition for TCC6 peripheral =================== */
#define PIN_PA01F_TCC6_WO0                         _UINT32_(1) 
#define MUX_PA01F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PA01F_TCC6_WO0                      ((PIN_PA01F_TCC6_WO0 << 16) | MUX_PA01F_TCC6_WO0)
#define PORT_PA01F_TCC6_WO0                        (_UINT32_(1) << 1)

#define PIN_PD12F_TCC6_WO0                         _UINT32_(108)
#define MUX_PD12F_TCC6_WO0                         _UINT32_(5) 
#define PINMUX_PD12F_TCC6_WO0                      ((PIN_PD12F_TCC6_WO0 << 16) | MUX_PD12F_TCC6_WO0)
#define PORT_PD12F_TCC6_WO0                        (_UINT32_(1) << 12)

#define PIN_PA02F_TCC6_WO1                         _UINT32_(2) 
#define MUX_PA02F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PA02F_TCC6_WO1                      ((PIN_PA02F_TCC6_WO1 << 16) | MUX_PA02F_TCC6_WO1)
#define PORT_PA02F_TCC6_WO1                        (_UINT32_(1) << 2)

#define PIN_PD13F_TCC6_WO1                         _UINT32_(109)
#define MUX_PD13F_TCC6_WO1                         _UINT32_(5) 
#define PINMUX_PD13F_TCC6_WO1                      ((PIN_PD13F_TCC6_WO1 << 16) | MUX_PD13F_TCC6_WO1)
#define PORT_PD13F_TCC6_WO1                        (_UINT32_(1) << 13)

/* =================== PORT definition for USB peripheral =================== */
#define PIN_PD01H_USB_SOF                          _UINT32_(97)
#define MUX_PD01H_USB_SOF                          _UINT32_(7) 
#define PINMUX_PD01H_USB_SOF                       ((PIN_PD01H_USB_SOF << 16) | MUX_PD01H_USB_SOF)
#define PORT_PD01H_USB_SOF                         (_UINT32_(1) << 1)

#define PIN_PD02H_USB_USBDM                        _UINT32_(98)
#define MUX_PD02H_USB_USBDM                        _UINT32_(7) 
#define PINMUX_PD02H_USB_USBDM                     ((PIN_PD02H_USB_USBDM << 16) | MUX_PD02H_USB_USBDM)
#define PORT_PD02H_USB_USBDM                       (_UINT32_(1) << 2)

#define PIN_PD03H_USB_USBDP                        _UINT32_(99)
#define MUX_PD03H_USB_USBDP                        _UINT32_(7) 
#define PINMUX_PD03H_USB_USBDP                     ((PIN_PD03H_USB_USBDP << 16) | MUX_PD03H_USB_USBDP)
#define PORT_PD03H_USB_USBDP                       (_UINT32_(1) << 3)



#endif /* _PIC32CM5112GC00100_GPIO_H_ */

